# 2. Написать точно такую же процедуру, но в декларативном стиле

lst = [2, 7, 3, 4, 9, 5, 6, 8, 1]
lst.sort(reverse=True)
print(lst)
